{
  "sightings": [
    {
      "text": "My wife was driving southeast on a fairly populated main side road, it was dark out side at about 6:43pm, And my wife exclaimed” falling star baby look quick!” When I looked up I saw not a falling star but a bright ball of light , one that was closer than any shooting star I have ever seen, it had a blue glow  changing into green colors of light as it fell from the sky. It fell as if falling from an invisible opening in the sky... the night was a crystal clear night sky  so no clouds or precipitation to obstruct our view and the object was closer than any I have ever witnessed before. The way the object fell was too slow to be a meteor or falling star, also noting that there was no “light trail” following behind the object as it fell. We watched it fall for about 5 seconds before it disappeared into the dark night sky somewhere close to the earth surface.  It was the strangest light; object; ufo... I have encountered and felt a duty to report it.",
      "stats": "Occurred : 12/12/2019 18:43  (Entered as : 12/12/19 18:43) Reported: 12/19/2019 7:19:31 PM 19:19 Posted: 12/22/2019 Location: Chester, VA Shape: Light Duration:5 seconds",
      "date_time": "12/12/19 18:43",
      "report_link": "http://www.nuforc.org/webreports/151/S151739.html",
      "city": "Chester",
      "state": "VA",
      "shape": "Light",
      "duration": "5 seconds",
      "summary": "My wife was driving southeast on a fairly populated main side road, it was dark out side at about 6:43pm, And my wife exclaimed” fallin"
    },
    {
      "text": "I think that I may caught a UFO on the NBC Nightly News that aired March 21st or 22nd. In this short clip of a Boeing 747, as the plane flies left to right, you can see a black circular object flying eradicably (sic.  Erraticly)) behind the tail wing,  I’m guessing at a distance of about 25-30 feet. If you slow the video down you can home in on the object more so.",
      "stats": "Occurred : 3/22/2019 18:30  (Entered as : 03/22/19 18:30) Reported: 3/27/2019 4:10:19 PM 16:10 Posted: 3/29/2019 Location: Rocky Hill, CT Shape: Circle Duration:3-5 seconds",
      "date_time": "3/22/19 18:30",
      "report_link": "http://www.nuforc.org/webreports/145/S145297.html",
      "city": "Rocky Hill",
      "state": "CT",
      "shape": "Circle",
      "duration": "3-5 seconds",
      "summary": "I think that I may caught a UFO on the NBC Nightly News that aired March 21st or 22nd."
    },
    {
      "text": "I woke up late in the afternoon 3:30-4pm.  I went to have a bath, while shaving my legs i noticed indentations around my left ankel.  I then noticed that they went all the way around the backs of both my legs and up to my thighs.  It scared me because a few nights before I was telling my fiancee that was pretty sure that i was abducted before, he laughed then that was that.  I showed him the indentations and he was shocked.  He suffers from insomnia.  We woke up at the same time.  He only sleeps maybe 4-5 hrs a wk.  He said that he slept all night with me.  The indentations look like my legs were seperated into stirups, or like how a massage chair would hold your legs.  The indents were in rows of 1-1.5 lines from my ankles all the way up to my thighs just below my buttocks.  They were perfectly lined.  They disappeared within 2 hrs of waking up.  I couldnt talk a picture because i had just lost my cell phone.",
      "stats": "Occurred : 4/1/2019 15:45  (Entered as : April01.19) Reported: 4/8/2019 9:42:31 PM 21:42 Posted: 4/12/2019 Location: Winnipeg (Canada),  Shape:  Duration:",
      "date_time": "April01.19",
      "report_link": "http://www.nuforc.org/webreports/145/S145556.html",
      "city": null,
      "state": null,
      "shape": null,
      "duration": null,
      "summary": "I woke up late in the afternoon 3:30-4pm. I went to have a bath, while shaving my legs i noticed indentations around my left ankel. I t"
    },
    {
      "text": "I was driving towards the intersection of fallowfield and eagleson when I saw a where streak in the sky like a falling plane or something.  I was shocked and it went down really fast towards the ground and disappeared.  Sorry for lack of details.  That is all I know.",
      "stats": "Occurred : 4/17/2019 02:00  (Entered as : 04-17-2019 2:00) Reported: 4/17/2019 8:41:25 AM 08:41 Posted: 4/18/2019 Location: Ottawa (Carleton) (Canada), ON Shape: Teardrop Duration:10 seconds",
      "date_time": "4/17/19 02:00",
      "report_link": "http://www.nuforc.org/webreports/145/S145697.html",
      "city": "Ottawa (Carleton) (Canada)",
      "state": "ON",
      "shape": "Teardrop",
      "duration": "10 seconds",
      "summary": "I was driving towards the intersection of fallowfield and eagleson when I saw a where streak in the sky like a falling plane or somethi"
    },
    {
      "text": "In Peoria, Arizona, I saw a cigar shaped craft floating above the neighborhood 500 feet up silent, emitted brilliant colors, Peoria Arizona - 2009 - On my way home from work - normal evening - as I turned onto my home street i saw a huge huge craft floating above the neighborhood in front of me.  It was cigar shaped, but had a huge bulge in the middle (I used to call it a pregnant joint - if you are familiar with how that would look - skinny on the ends but bulging in the middle.  It made no noise at all and had circular shapes on the front which emitted different colored lights - like it pulsated the lights - orange to red to green to blue.  They were the most brilliant colors I’ve ever seen it’s hard to describe how perfect the colors were.  It was huge like an aircraft carrier in the sky.  It was floating and did not move at all.  I parked in my driveway and ran inside to tell my Roomate.  By the time I was outside, it was gone but there as a trail of haze.  I will never forget it. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)",
      "stats": "Occurred : 3/15/2009 18:00  (Entered as : 03/15/09 18:00) Reported: 4/17/2019 6:30:52 PM 18:30 Posted: 4/18/2019 Location: Peoria, NY Shape: Cigar Duration:2 minutes",
      "date_time": "3/15/09 18:00",
      "report_link": "http://www.nuforc.org/webreports/145/S145723.html",
      "city": "Peoria",
      "state": "NY",
      "shape": "Cigar",
      "duration": "2 minutes",
      "summary": "In Peoria Arizona, I saw a cigar shaped craft floating above the neighborhood 500 feet up silent, emitted brilliant colors,"
    },
    {
      "text": "Description is the same as Washington, DC, event in the 50’s   Glitter type objects . Still scanning .... A-10’s scrambled out of David monathin airbase. ??",
      "stats": "Occurred : 5/1/2019 11:00  (Entered as : 5/1/19 11:00) Reported: 5/1/2019 11:26:56 AM 11:26 Posted: 5/9/2019 Location: Tucson, AZ Shape: Unknown Duration:5 minutes",
      "date_time": "5/1/19 11:00",
      "report_link": "http://www.nuforc.org/webreports/145/S145947.html",
      "city": "Tucson",
      "state": "AZ",
      "shape": "Unknown",
      "duration": "5 minutes",
      "summary": "Description is the same as Washington DC event in the 50’s  Glitter type objects ."
    },
    {
      "text": "Apr. 10th we witnessed a very bright silvery round object hovering near zenith over our community looking like a very bright star. On Apr. 10th at aprox. 7pm we witnessed a very bright silvery round object hovering near zenith over our community looking like a very large bright star.  It did not appear to move for the 10 minutes it was observed in conflict with very strong winds.  It changed color from bright shinny to reddish as the sun was setting, made no noise, and was unobservable after the sunset.  2 photos were taken with each  looking totally different in appearance ... they were taken only 3 min. apart. The observers are all retired professionals.",
      "stats": "Occurred : 4/10/2019 17:00  (Entered as : 04/10/2019 17:00) Reported: 4/20/2019 5:28:10 PM 17:28 Posted: 4/25/2019 Location: Gold Canyon, AZ Shape: Circle Duration:10 minutes",
      "date_time": "4/10/19 17:00",
      "report_link": "http://www.nuforc.org/webreports/145/S145766.html",
      "city": "Gold Canyon",
      "state": "AZ",
      "shape": "Circle",
      "duration": "10 minutes",
      "summary": "Apr. 10th we witnessed a very bright silvery round object hovering near zenith over our community looking like a very bright star.",
      "posted": "4/25/19"
    },
    {
      "text": "Ufos report in Irving Texas at 2200 hrs.  On or about July 1973 or 1974. Myself and my mother her sister and daughter was watching tv waiting for the news to come on, at 2200 hrs watching wffa channel 8 news the reporter said, \"Folks, if you want to see something amazing go out side and look over the Dallas skyline\" which we did as well as most of the block. What we all saw was three objects looked like the size of a golf balls from about 9 miles from Dallas texas looking east.  At about a 1000 to 1500 feet above Dallas.  These objects was stationery each emitting different colors like blue gold red green silver.  It was rather superb looking.  After just standing there for about a minute each one started to do bizzar monuvers like one was zigzaging the other one was going up then down zipping from on side of the sky back and forth with the other two, at on point they formed a close circle and went spinning around at very fast speed. This lasted for about 3 min.  When the US Navy put a halt to the airshow as they scrambled two F-8 crusaders which at that time was hot alert aircraft, which ment they was armed with the sidewinder missile, along with the 50.cal guns.  They flew from NAS Hensley field out side of Dallas on the southwest just about 6 miles away, it only took about 20 seconds from the time they took off to get  over Dallas.  (I seen them as they left the air station only 3 miles away) never will forget how loud they was in full afterburner,  Just before they got on station, the three objects shot straight up in the night sky in a split second.  The F-8s made a few passes over Dallas before returning to there base. This left me with a impression that the ufos wanted to show the people what they could do, I know aircraft and it was nothing  that any aircraft or helicopter could do. Not only did my family see this but was reported by was channel 8 news along with hundreds of people I will say on thing this report is not a hoax I seen other sightings as well but none as this one.",
      "stats": "Occurred : 7/14/1973 22:00  (Entered as : 07/14/73 22:00) Reported: 4/20/2019 2:21:04 AM 02:21 Posted: 4/25/2019 Location: Dallas, TX Shape: Oval Duration:6 minutes",
      "date_time": "7/14/73 22:00",
      "report_link": "http://www.nuforc.org/webreports/145/S145751.html",
      "city": "Dallas",
      "state": "TX",
      "shape": "Oval",
      "duration": "6 minutes",
      "summary": "Ufos report in Irving Texas at 2200 hrs. On or about July 1973 or 1974.",
      "posted": "4/25/19"
    },
    {
      "text": "group of lights formation sweeping thru a night sky sigthing of strange group light almost transparent coming from going northward.  I found an video from youtube almost like what I saw of this group of light.I took a snip of this image from the video from mufon.  What i saw is exactly like that.  should you need the image capture from youtube image from mufon will gladly email it.  Just to prove what i saw, and maybe you can tell me if what I saw is authentic.  Philippines is the least place to experience this kind of unidentified object.  Again next time i will have a cellphone camera ready or any image capturing device.",
      "stats": "Occurred : 6/6/2019 19:00  (Entered as : 6/6/2019 19:00) Reported: 6/7/2019 12:10:27 PM 12:10 Posted: 6/7/2019 Location: Caloocan City (Philippines),  Shape: Other Duration:19:00 to 19:30",
      "date_time": "6/6/19 19:00",
      "report_link": "http://www.nuforc.org/webreports/146/S146694.html",
      "city": "Caloocan City (Philippines)",
      "state": null,
      "shape": "Other",
      "duration": "19:00 to 19:30",
      "summary": "Group of lights formation sweeping thru a night sky",
      "posted": "6/7/19"
    },
    {
      "text": "Metal orb of wires that was seen through a telescope after noticing a bright light that hovered in the sky for about an hour. Noticed a light in the sky that looked like an airplane, but never moved.  Proceeded to get telescope out and noticed a sphere that looked as if it was made out of wires.  Also noticed 2 black things inside of the center or at times one black thing and a tail on it.  No lights were on it and once the sun went over the horizon it was very hard to see.  There was 3 other of these lights in the sky very far apart from each other.   The whole incident lasted a whole hour but I am sure it was there for half an hour more at least. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "stats": "Occurred : 6/18/2019 21:00  (Entered as : 6/18/19 21:00) Reported: 6/18/2019 7:10:28 PM 19:10 Posted: 6/20/2019 Location: Brookville, IN Shape: Sphere Duration:1 hour",
      "date_time": "6/18/19 21:00",
      "report_link": "http://www.nuforc.org/webreports/146/S146900.html",
      "city": "Brookville",
      "state": "IN",
      "shape": "Sphere",
      "duration": "1 hour",
      "summary": "Metal orb of wires that was seen through a telescope after noticing a bright light that hovered in the sky. ((anonymous report))",
      "posted": "6/20/19"
    },
    {
      "text": "We think 2 UFOs....2 tiny lights recorded for about a minute.  We watched the top light bolt higher and then the lower light does an unbelievable semi circle motion.  Moved SO FAST like nothing I have ever seen before.",
      "stats": "Occurred : 6/12/2019 22:00  (Entered as : 06/12/2019 22:00) Reported: 6/13/2019 5:27:17 AM 05:27 Posted: 6/20/2019 Location: Melbourne Beach, FL Shape: Unknown Duration:Hour",
      "date_time": "6/12/19 22:00",
      "report_link": "http://www.nuforc.org/webreports/146/S146805.html",
      "city": "Melbourne Beach",
      "state": "FL",
      "shape": "Unknown",
      "duration": "Hour",
      "summary": "2 tiny lights recorded for about a minute.  We watched the top light bolt higher and then the lower light does a semi-circle.",
      "posted": "6/20/19"
    },
    {
      "text": "I was driving and saw three glowing orbs is the best I can describe it.  I was driving trying to keep an eye on it and as I watched it, it just disappeared.  I also saw something else that could be related, it just didn't look right two lights almost looked like they were hovering and they did change location in the sky and were lower than the stars or what could be satellites, it did not look right to me",
      "stats": "Occurred : 6/11/2019 22:00  (Entered as : June 11 20 22:00) Reported: 6/11/2019 10:18:14 PM 22:18 Posted: 6/20/2019 Location: Carrizozo, NM Shape: Changing Duration:Few minutes",
      "date_time": "6/11/19 22:00",
      "report_link": "http://www.nuforc.org/webreports/146/S146759.html",
      "city": "Carrizozo",
      "state": "NM",
      "shape": "Changing",
      "duration": "Few minutes",
      "summary": "I was driving and saw three glowing orbs is the best I can describe it. I was driving trying to keep an eye on it and as I watched it,",
      "posted": "6/20/19"
    },
    {
      "text": "I was in pool and my wife was sitting on the edge. We heard a sound to the southwest.  It sound like a jet type engine, but not a plane.  Then a circular object came over the trees of our back yard at what I would say would be a helicopter type height, but it was not a helicopter. It didn't sound like a jet or a helicopter, but it was a jet type sound. It moved slowly in a northeast direction and hovered directly over our pool for about 5 to 10 seconds and then continued to slowly continue. When it was above we could see what looked like two jet type engines at the back of the craft facing in a downward direction then they rotated back some and it continued moving slowly until it was out of site due to the roof of our house. We were both looking in amazement and didn't think to grab my phone to video until it had almost cleared the house and you really could see anything on the video since I tried to take the video so fast. We live near Space X, which is the general direction it came from and are about 35 minutes from Ft. Hood army base.  So we thought maybe it might be an experimental craft. I am so mad at myself for not immediately grabbing my phone. ((NUFORC Note:  We spoke via telephone with the witness, and he corrected the date to 2018.  He seemed to us to be quite sober-minded, and we suspect that he and his wife probably are very capable and reliable witnesses.  PD))",
      "stats": "Occurred : 6/15/2018 01:00  (Entered as : 06/15/19 1:00) Reported: 6/10/2019 1:23:41 PM 13:23 Posted: 6/20/2019 Location: Waco, TX Shape: Circle Duration:2 minute",
      "date_time": "6/15/18 01:00",
      "report_link": "http://www.nuforc.org/webreports/146/S146740.html",
      "city": "Waco",
      "state": "TX",
      "shape": "Circle",
      "duration": "2 minute",
      "summary": "I was in pool and my wife was sitting on the edge.",
      "posted": "6/20/19"
    },
    {
      "text": "Bright Circle of Light followed me from Oskaloosa, IA, to Centerville, IA.. I was on my way home from Pella, IA.  Driving to Centerville, IA.  Around the Oskaloosa, IA exit. I seen a bright white light.  It stayed with me until I reached Centerville, IA.  There is a water tower on the south east  side of town.  I stopped and the light stopped and it was between the ball on top of the water tower and the part that comes out of the ground.   I rolled down my window.  It made no noise the light didn’t move this was for about 4 minutes. .  I got scared and started to drive and the light went straight up into the sky and went back north. Back in the direction in which it followed me.   I wish I would have gotten out of my car and walked towards it.  I hope before I pass I am able to see it again or see another UFO.  I won’t be scared and I will try and get closer.  It is now 2019.",
      "stats": "Occurred : 8/15/1999 02:30  (Entered as : 08/15/1999 2:30) Reported: 6/8/2019 1:55:19 AM 01:55 Posted: 6/20/2019 Location: Centerville, IA Shape: Circle Duration:1 hour",
      "date_time": "8/15/99 02:30",
      "report_link": "http://www.nuforc.org/webreports/146/S146702.html",
      "city": "Centerville",
      "state": "IA",
      "shape": "Circle",
      "duration": "1 hour",
      "summary": "Bright Circle of Light followed me from Oskaloosa IA to Centerville, IA.",
      "posted": "6/20/19"
    },
    {
      "text": "Strange bright light hovered over mobile home. ((NUFORC Note:  Witness indicates that the date of the sighting is approximate.  PD)",
      "stats": "Occurred : 7/17/1975 00:00  (Entered as : 07/17/1975 00:00) Reported: 6/27/2019 7:49:44 PM 19:49 Posted: 7/5/2019 Location: Gray Court, SC Shape: Light Duration:5 minutes",
      "date_time": "7/17/75 00:00",
      "report_link": "http://www.nuforc.org/webreports/147/S147117.html",
      "city": "Gray Court",
      "state": "SC",
      "shape": "Light",
      "duration": "5 minutes",
      "summary": "Strange bright light hovered over mobile home.",
      "posted": "7/5/19"
    },
    {
      "text": "There were 4 lights in diagonal formation that moved side to side to side.  The fifth craft was moving in a figure 8 motion.  The fifth craft was noticeably lower than the others.   I have video proof of the 4 diagonal crafts.",
      "stats": "Occurred : 8/17/2019 00:00  (Entered as : 081719 0:00) Reported: 8/17/2019 2:10:35 AM 02:10 Posted: 8/23/2019 Location: Yuba City, CA Shape: Formation Duration:20 minutes",
      "date_time": "8/17/19 00:00",
      "report_link": "http://www.nuforc.org/webreports/148/S148345.html",
      "city": "Yuba City",
      "state": "CA",
      "shape": "Formation",
      "duration": "20 minutes",
      "summary": "There were 4 lights in diagonal formation that moved side to side to side.  The fifth craft was moving in a figure 8 motion.",
      "posted": "8/23/19"
    },
    {
      "text": "star-like light that started bouncing in the air before disappearing I was driving on the highway heading south, and in the air kind of behind these apartments off of the highway there was a bright light that looked like a star but was a slight bit bigger and brighter, it had a light blue color to it.  it was floating there for a few seconds then it started “bouncing” up and down rapidly in the air and changing colors from light blue to red. it stopped bouncing and sat still for a few seconds before it disappeared.",
      "stats": "Occurred : 8/14/2019 01:00  (Entered as : 08/14/19 01:00) Reported: 8/19/2019 1:26:51 AM 01:26 Posted: 8/23/2019 Location: Abilene, TX Shape: Light Duration:30 seconds",
      "date_time": "8/14/19 01:00",
      "report_link": "http://www.nuforc.org/webreports/148/S148373.html",
      "city": "Abilene",
      "state": "TX",
      "shape": "Light",
      "duration": "30 seconds",
      "summary": "Star-like light that started bouncing in the air before disappearing",
      "posted": "8/23/19"
    },
    {
      "text": "There where 4 bright lights in a shape of a diamond, they where moving slow.  After I took the video one of the lights went east and the other three lights remained in the same spot.",
      "stats": "Occurred : 8/9/2019 20:22  (Entered as : 08/09/19 20:22) Reported: 8/10/2019 3:06:11 PM 15:06 Posted: 8/23/2019 Location: Leyner, CO Shape: Light Duration:20 minutes",
      "date_time": "8/9/19 20:22",
      "report_link": "http://www.nuforc.org/webreports/148/S148205.html",
      "city": "Leyner",
      "state": "CO",
      "shape": "Light",
      "duration": "20 minutes",
      "summary": "There where 4 bright lights in a shape of a diamond, they where moving slow. After I took the video one of the lights went east and the",
      "posted": "8/23/19"
    },
    {
      "text": "My wife and I were taking our usual evening stroll approx. 8:30 to 8:40 pm in the evening.  We observed a cigar shaped craft hovering in the south west sky approx. 1000 feet.  Color was orangish red.  It caught out attention bc at first it lit up rather brightly for several seconds then dimmed down and shifted to the west then slowly faded out. ((NUFORC Note:  Witness elects to remain totally anonymous; provides no contact information.  PD))",
      "stats": "Occurred : 8/9/2019 20:30  (Entered as : 08/09/19 20:30) Reported: 8/15/2019 11:16:08 AM 11:16 Posted: 8/23/2019 Location: Catalina, AZ Shape: Cigar Duration:40 seconds",
      "date_time": "8/9/19 20:30",
      "report_link": "http://www.nuforc.org/webreports/148/S148290.html",
      "city": "Catalina",
      "state": "AZ",
      "shape": "Cigar",
      "duration": "40 seconds",
      "summary": "My wife and I were taking our usual evening stroll approx. 8:30 to 8:40 pm in the evening. We observed a cigar shaped craft hovering in",
      "posted": "8/23/19"
    },
    {
      "text": "Edit here",
      "stats": "Edit here",
      "date_time": "Edit here",
      "report_link": "Edit here",
      "city": "Edit here",
      "state": "Edit here",
      "shape": "Edit here",
      "duration": "Edit here",
      "summary": "Edit here",
      "posted": "Edit here"
    }
  ]
}
